/* Да се напише програма, която обработва броя на ваксините, произведени от фирма за дните от 1 до 31 декември 2020, по следния начин:
 * а) въвежда броя на ваксините, произведени от фирмата за всеки един ден от 1.12.2020г до 31.12.2020г  включително - стойности до 5000. (случайни числа)
 * б) извежда колко (като брой) са дните, през които са произведени по по‐малко от 3000 ваксини на ден;
 * в) извежда минималния брой ваксини, произведени от фирмата за един ден;
 */

// масив от 31 цели числа- от 0 до 30 или 1 до 31...
/*  const int n = 31;
int vacday[n + 1];
cout << "Програма за ваксини." << endl;
*/

#include <iostream>
#include <ctime>
using namespace std;
int main()
{
	const int n=31;	int vacday[n+1];
	cout<<"Програма за ваксини."<<endl;

// начало на а) - въвеждане на масива от 31 дни
	srand(static_cast<unsigned>(time(NULL)));
	for(int i=1; i<=n; i++)	// цикъл от 1 до 31 (в случая)
	{
		do
		{
			cout<<"Въведете брой ваксини за ден "<<i<<": ";
			vacday[i]=rand()%10000;
			//cin>>vacday[i];, за ръчно набавяне
			cout<<vacday[i]<<endl;
		}
		while(vacday[i]>5000);
	}
// край на а)
// начало на б) - брой дни с по-малко от 3000 ваксини в този ден
	int br=0;
	for(int i=0; i<=n; i++)
		if(vacday[i]<3000)
			br=br+1;
	cout<<"Броят дни с ваксини под 3000 е/са: "<<br<<endl;
// край на б)
// начало на в) - намиране на минамален брой ваксини
	int minbroi=vacday[1];
	for(int i=0; i<=n; i++)
		if(vacday[1]<minbroi)
			minbroi=vacday[1];
	cout<<"Най-малко количество ваксини за ден са: "<<minbroi<<endl;
// край на в)

	system("pause");
	return 0;
}
