// Да се въведат от клавиатурата стойности за елементите на едномерен масив от n цели числа (n е константа):
// a) да се изведат на един ред елементите на масива;
// б) да се изведат елементите в обратен ред;
// в) да се намери средното аритметично от елементите на масива;
// г) да се намерят минималният и максималният елементи;
// д) да се изведат елементите на масива по m на ред (m се въвежда от клавиатурата)
#include <iostream>
using namespace std;
int main()
{
	const int n=10; // брой на елементите на масива
	int i, mas[n]; // дефиниране на масива

	// въвеждане на елементите
	for(i=0; i<n; ++i)
	{
		cout<<"mas["<<i<<"]=";	cin>>mas[i];
	}

	// Извеждане в един ред, разделени с интервали
	for(i=0; i<n; ++i)
		cout<<mas[i]<<' ';
	cout<<endl;

	// Извеждане в обратен ред
	for(i=n-1; i>=0; --i)
		cout<<mas[i]<<' ';
	cout<<endl;

	// Намиране на средното аритметично
	double s=0.0;
	for(i=0; i<n; ++i)
		s+=mas[i];
	cout<<"Average: "<<s/n<<endl;

	// Намиране на минимален и максимален елементи
	int min, max;
	min=max=mas[0]; // начални стойности
	for(i=1; i<n; ++i)
	{
		if(mas[i]<min) min=mas[i];
		if(mas[i]>max) max=mas[i];
	}
	cout<<"min= "<<min<<endl;
	cout<<"max= "<<max<<endl;

	// Извеждане по m на ред
	int j=0, m;
	cout<<"m=";		cin>>m;
	for(i=0; i<n; ++i)
	{
		cout<<mas[i]<<' ';	++j;
		if(j==m)
		{
			cout<<endl;		j=0;
		}
	}
	cout<<endl;
	return 0;
}
