// Да се напише програма, която прочита трицифрено число въведено от клавиатурата и извежда на отделни редове цифрите на стотиците, десетиците и единиците.
#include <iostream>
#include <iomanip>
using namespace std;
int main()
{

    int a, b, c, d;
    cout << "Въведете цяло трицифрено число" << "\n";
    cin >> a;
    b = a / 100;
    c = a / 10 % 10;
    d = a % 10;
    cout << "Цифрата на стотиците е = " << b << endl;
    cout << "Цифрата на десетиците е = " << c << endl;
    cout << "Цифрата на единиците е = " << d << endl;
    system("pause > 0");
    return 0;
}
