// Да се състави програма, реализираща прост калкулатор – от клавиатурата се въвеждат две реални числа и знак за операция между тях. Например въвежда се “3+2”. Допустимите операции са събиране, изваждане, умножение и деление. На екрана да се изведе резултата от операцията, ако тя е възможна или подходящо съобщение в противен случай.
#include <iostream>
using namespace std;
int main()
{
	double a, b; //операнди
	char op; // знак за операцията
	cout<<"Въведете задачата си тук: ";	cin>>a>>op>>b;

	switch(op)
	{
	case '+': cout<<"Отговорът на задачата е: "<<a+b<<endl; break;
	case '-': cout<<"Отговорът на задачата е: "<<a-b<<endl; break;
	case '*': cout<<"Отговорът на задачата е: "<<a*b<<endl; break;
	case '/':
			if(b!=0)
				cout<<"Отговорът на задачата е: "<<a/b<<endl;
			else
				cout<<"Деление с нула!"<<endl; break;
	default: cout<<"Неразпознаваемо действие!";
	}
	return 0;
}
