// Да се напише програма, която въвежда по редове правоъгълна матрица Anxk от реални числа и извежда матрицата. Извежда матрица, образувана от редовете на A от четна позиция, като всеки елемент е увеличен с 1, след което извежда матрица, образувана от редовете от нечетна позиция, като всеки елемент е увеличен с 2 и накрая, ако n е четно, извежда сумата на матриците от редовете от четните и нечетните позиции на A.
#include <iostream>
#include <iomanip>
using namespace std;
int main()
{
	int a[20][100]; int* p[20]; int* q[20];
	cout<<"n, k= ";	int n, k;	cin>>n>>k;

	if(!cin)
	{
		cout<<"Error!"<<endl;
		return 0;
	}
	// въвеждане на матрицата
	int i,j;
	for(i=0; i<=n-1;++i)
		for(j=0; j<=k-1; ++j)
		{
			cout<<"a["<<i<<"]["<<j<<"]";
			cin>>*(*(a+i)+j);
		}

	// извеждане на матрицата
	for(i=0; i<=n-1; ++i)
	{
		for(j=0; j<=k-1; ++k)
			cout<<setw(10)<<*(*(a+i)+j);
	cout<<endl;
	}

	cout<<"Нова матрица от редовете в четни позиции"<<endl;
	// конструиране
	int m=1;
	for(i=0; i<=n; i=i+2)
	{
		m++;
		*(p+m)=*(a+i);
	}
	// извеждане с увеличение на елементите с 1
	for(i=0; i<=m; ++i)
	{
		for(j=0; j<=k-1; j++)
			cout<<setw(10)<<*(*(p+i)+j)+1;
		cout<<endl;
	}

	cout<<"Нова матрица от редовете в нечетни позиции"<<endl;
		// конструиране
		int l=-1;
		for(i=1; i<=n-1; i=i+2)
		{
			l++;
			q[l]=a[i];
		}
		// извеждане с увеличение на елементите с 2
		for(i=0; i<=l; ++i)
		{
			for(j=0; j<=k-1; j++)
				cout<<setw(10)<<*(*(q+i)+j)+2;
			cout<<endl;
		}

		// сумиране на двете матрици, ако n e четно
		if(n%2==0)
			for(i=0; i<=m; i++)
			{
				for(j=0; j<=k-1; j++)
					cout<<setw(10)<<*(*(p+i)+j)+*(*(q+i)+j);
				cout<<endl;
			}

		return 0;
		system("pause");
}

